In [2]:
!python --version

Python 3.10.8

In [127]:
import pandas as pd
mydataset={"cars":["BMW","zeebra","FIAT","FORD"],
"BIKES":["SPLENDOR","GLAMOUR","ROYAL ENFIELD","12"]}

In [128]:
mydataset

{'cars': ['BMW', 'zeebra', 'FIAT', 'FORD'],
 'BIKES': ['SPLENDOR', 'GLAMOUR', 'ROYAL ENFIELD', '12']}

In [129]:
df=pd.DataFrame(mydataset)

In [130]:
df

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [131]:
df['cars']

0       BMW
1    zeebra
2      FIAT
3      FORD
Name: cars, dtype: object

In [132]:
df['BIKES']

0         SPLENDOR
1          GLAMOUR
2    ROYAL ENFIELD
3               12
Name: BIKES, dtype: object

In [133]:
df

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [134]:
df.loc[0]

cars          BMW
BIKES    SPLENDOR
Name: 0, dtype: object

In [135]:
df.iloc[0]

cars          BMW
BIKES    SPLENDOR
Name: 0, dtype: object

In [136]:
df.head()

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [137]:
df.shape

(4, 2)

In [138]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cars    4 non-null      object
 1   BIKES   4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [139]:
df.dtypes

cars     object
BIKES    object
dtype: object

In [140]:
df.dtypes

cars     object
BIKES    object
dtype: object

In [141]:
df['cars'] = df['cars'].astype('str')

In [142]:
df['cars']

0       BMW
1    zeebra
2      FIAT
3      FORD
Name: cars, dtype: object

In [143]:
df.columns.values

array(['cars', 'BIKES'], dtype=object)

In [144]:
df.describe().transpose

<bound method DataFrame.transpose of        cars     BIKES
count     4         4
unique    4         4
top     BMW  SPLENDOR
freq      1         1>

In [145]:
orderedcars=df['cars'].sort_values(ascending=True)

In [146]:
orderedcars

0       BMW
2      FIAT
3      FORD
1    zeebra
Name: cars, dtype: object

In [147]:
type(orderedcars)

pandas.core.series.Series

In [148]:
df

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [149]:
df['BIKES'].unique()

array(['SPLENDOR', 'GLAMOUR', 'ROYAL ENFIELD', '12'], dtype=object)

In [150]:
df.sort_values(by=['BIKES'])

     cars          BIKES
3    FORD             12
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
0     BMW       SPLENDOR

In [151]:
df.loc[2]

cars              FIAT
BIKES    ROYAL ENFIELD
Name: 2, dtype: object

In [152]:
df.T

              0        1              2     3
cars        BMW   zeebra           FIAT  FORD
BIKES  SPLENDOR  GLAMOUR  ROYAL ENFIELD    12

In [153]:
df

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [154]:
df.loc[2:-1]

Empty DataFrame
Columns: [cars, BIKES]
Index: []

In [120]:
df.loc[2]

cars              FIAT
BIKES    ROYAL ENFIELD
Name: 2, dtype: object

In [155]:
df

     cars          BIKES
0     BMW       SPLENDOR
1  zeebra        GLAMOUR
2    FIAT  ROYAL ENFIELD
3    FORD             12

In [158]:
df.loc[:1]

     cars     BIKES
0     BMW  SPLENDOR
1  zeebra   GLAMOUR